//
//  PostData.swift
//  Navigation
//
//  Created by Александр Касьянов on 17.03.2022.
//

import Foundation

var post1 = Post(author: "Steam Jet выступили с \"шестым игроком\"", description: "Концерт Steam Jet в клубе Action состоялся с двумя басистами. Курьёз произошёл по причине того, что оригинального басиста изначально должен был заменить \"шестой полевой\" музыкант - Александр Мутин. Однако, как оказалось позже, Владимир Пакин всё же смог дать концерт и, чтобы не нарушать обещание, Александр сыграл с группой несколько композиций.", image: "Pic01.jpg", likes: 25, views: 30, isLiked: false, isViewed: false)
var post2 = Post(author: "Поздравляем с пополнением!", description: "У басиста группы Steam Jet Владимира Пакина на днях произошло пополнение в семействе - у него родился сын! Мальчика назвали Платоном - в честь кого, пока непонятно. Напомним, что Владимир сам работает акушером-гинекологом и на его счету не один десяток рождённый малыш.", image: "Pic02", likes: 23, views: 28, isLiked: false, isViewed: false)
var post3 = Post(author: "С обновлением!", description: "Ритм-гитарист Steam Jet Павел Власов недавно приобрёл новую гитару. Интересно то, что гитара старше него самого почти на пятнадцать лет! Желаем Павлу крепких струн и чтобы Хэтфилд обзавидовался!", image: "Pic03", likes: 15, views: 18, isLiked: false, isViewed: false)
